[
    {
        "exerciseId": 1,
        "exerciseName": "Seated Cable Rows",
        "muscleGroup": "Back",
        "description": "Sit on the bench with your knees bent and grasp the cable attachment. It often has a triangle handle, but it may be a bar. Position yourself with your knees slightly bent, so you have to reach to grab the handle with outstretched arms without curling the lower back over. Brace the abdominals, and you're ready to row",
        "repRange": "8-12",
        "difficulty": "Intermediate",
        "imageUrl": "assets/images/Row.png",
        "video": "https://www.youtube.com/embed/sP_4vybjVJs"
    },
    {
        "exerciseId": 2,
        "exerciseName": "Lat Pulldowns",
        "muscleGroup": "Back",
        "description": "Grasp the bar with a overhand wide grip with an overhand. Pull the bar down until it's approximately level with the chin. Exhale on the downward motion. Squeeze the shoulder blades together while maintaining square shoulders.",
        "repRange": "8-12",
        "difficulty": "Beginner",
        "imageUrl": "assets/images/LatPulldown.webp",
        "video": "https://www.youtube.com/embed/j9jtjL8FhPI"
    },
    {
        "exerciseId": 3,
        "exerciseName": "Deadlift",
        "muscleGroup": "Compound",
        "description": "The deadlift is a movement in which your hips hinge backward to lower down and pick up a weighted barbell or kettlebell from the floor. Your back is flat throughout the movement. Some benefits of performing deadlifts include strengthening and gaining more definition in your upper and lower back, glutes, and hamstrings.",
        "repRange": "1-4",
        "difficulty": "Advanced",
        "imageUrl": "assets/images/deadLift.jpg",
        "video": "https://www.youtube.com/embed/r4MzxtBKyNE"
    },
    {
        "exerciseId": 4,
        "exerciseName": "Squat (Back)",
        "muscleGroup": "Legs",
        "description": "A squat is a strength exercise in which the trainee lowers their hips from a standing position and then stands back up. During the descent of a squat, the hip and knee joints flex while the ankle joint dorsiflexes; conversely the hip and knee joints extend and the ankle joint plantarflexes when standing up.",
        "repRange": "4-8",
        "difficulty": "Intermediate",
        "imageUrl": "assets/images/backSquat.jpg",
        "video": "https://www.youtube.com/embed/Uv_DKDl7EjA"
    },
    {
        "exerciseId": 5,
        "exerciseName": "Squat (Front)",
        "muscleGroup": "Legs",
        "description": "A front squat is a squat that is performed while holding a barbell except, unlike with a back squat, the bar is held in front of the chest. This places more force on the upper body while still working the glutes, hamstrings, and hips.",
        "repRange": "4-8",
        "difficulty": "Intermediate",
        "imageUrl": "assets/images/frontSquat.jpg",
        "video": "https://www.youtube.com/embed/7pyxT5hqmQY"
    },
    {
        "exerciseId": 6,
        "exerciseName": "Bulgarian Split Squats",
        "muscleGroup": "Legs",
        "description": "From a standing position, bend your knees and push your hips back as you would for a regular squat. Stop when your thighs are parallel to the ground. Pause briefly with your knees over, but not beyond, your toes. Push through your heels to return to the starting position, giving your glutes a squeeze at the top",
        "repRange": "8-12",
        "difficulty": "Beginner",
        "imageUrl": "assets/images/bulgarian.jpg",
        "video": "https://www.youtube.com/embed/hPlKPjohFS0"
    },
    {
        "exerciseId": 7,
        "exerciseName": "Leg Extensions",
        "muscleGroup": "Legs",
        "description": "Leg extensions are exercises usually done with a lever machine. You sit on a padded seat and raise a padded bar with your legs. The exercise works mainly the quadriceps muscles of the front of the thigh—the rectus femoris and the vastus muscles.",
        "repRange": "8-12",
        "difficulty": "Beginner",
        "imageUrl": "assets/images/legExtensions.jpg",
        "video": "https://www.youtube.com/embed/9nmAtebIwy8"
    },
    {
        "exerciseId": 8,
        "exerciseName": "Hamstring Curls",
        "muscleGroup": "Legs",
        "description": "The hamstring curl, also called a leg curl, is an exercise that strengthens the hamstrings. It involves bending your knees and moving your heels toward your butt while the rest of your body stays still. Typically, the exercise is done on a leg curl machine",
        "repRange": "8-12",
        "difficulty": "Beginner",
        "imageUrl": "assets/images/hamstringCurls.jpg",
        "video": "https://www.youtube.com/embed/F488k67BTNo"
    },
    {
        "exerciseId": 9,
        "exerciseName": "Calf Raises",
        "muscleGroup": "Calfs",
        "description": "Exercises don't come much simpler than the calf raise. Stand up straight, then push through the balls of your feet and raise your heel until you are standing on your toes. Then lower slowly back to the start.",
        "repRange": "12-15",
        "difficulty": "Beginner",
        "imageUrl": "assets/images/calfRaises.jpg",
        "video": "https://www.youtube.com/embed/gwLzBJYoWlI"
    },
    {
        "exerciseId": 10,
        "exerciseName": "Romanian Deadlifts",
        "muscleGroup": "Hamstrings",
        "description": "The Romanian deadlift (RDL) is a traditional barbell lift used to develop the strength of the posterior chain muscles, including the erector spinae, gluteus maximus, hamstrings and adductors. When done correctly, the RDL is an effective exercise that helps strengthen both the core and the lower body with one move.",
        "repRange": "8-12",
        "difficulty": "Advanced",
        "imageUrl": "assets/images/rdls.webp",
        "video": "https://www.youtube.com/embed/7AaaYhMqTws"
    },
    {
        "exerciseId": 11,
        "exerciseName": "Hack Squat",
        "muscleGroup": "Legs",
        "description": "The HS is a Squat variation that is performed on a machine and involves pushing the weight away from you, at an angle, as you stand back up. You must stand on the plate with your body leaning back against the pads. The weight is moved during the concentric phase of the movement.",
        "repRange": "8-12",
        "difficulty": "Beginner",
        "imageUrl": "assets/images/hackSquat.jpg",
        "video": "https://www.youtube.com/embed/0tn5K9NlCfo"
    },
    {
        "exerciseId": 12,
        "exerciseName": "Arnlod Press",
        "muscleGroup": "Sholders",
        "description": "The Arnold presses is defined by a wrist rotation movement that ends when your palms face forward at the top of the press. The Arnold press uses dumbbells to work many of the main muscle groups in your upper body, including the triceps, trapezius, and the delts.",
        "repRange": "8-12",
        "difficulty": "Beginner",
        "imageUrl": "assets/images/arnolds.jpg",
        "video": "https://www.youtube.com/embed/3ml7BH7mNwQ"
    },
    {
        "exerciseId": 13,
        "exerciseName": "Lateral Raise",
        "muscleGroup": "Sholders",
        "description": "A lateral raise is a strength training shoulder exercise characterized by lifting a pair of dumbbells away from your body in an external rotation. Lateral raises work the trapezius muscle in your upper back as well as the deltoid muscle group in your shoulders—particularly the anterior and lateral deltoids.",
        "repRange": "8-12",
        "difficulty": "Beginner",
        "imageUrl": "assets/images/lateralRaise.webp",
        "video": "https://www.youtube.com/embed/kDqklk1ZESo"
    },
    {
        "exerciseId": 14,
        "exerciseName": "Face Pulls",
        "muscleGroup": "Sholders",
        "description": "What Is the Face Pull Exercise? The face pull is an isolation exercise that activates muscles in your lower back and upper back—specifically the rear deltoids on the back of your shoulders. Practice face pulls by standing in front of a cable pulley machine. Grab the rope attachment with an overhand grip.",
        "repRange": "8-12",
        "difficulty": "Beginner",
        "imageUrl": "assets/images/facePulls.jpg",
        "video": "https://www.youtube.com/embed/V8dZ3pyiCBo"
    },
    {
        "exerciseId": 15,
        "exerciseName": "Front Raise",
        "muscleGroup": "Sholders",
        "description": "The front raise, also known as the dumbbell front raise, is a weight training exercise that targets your shoulder muscles. Perform front raises by standing and using an overhand grip to lift a pair of dumbbells from the front of your thighs to shoulder level in front of your body.",
        "repRange": "8-12",
        "difficulty": "Beginner",
        "imageUrl": "assets/images/frontRaise.png",
        "video": "https://www.youtube.com/embed/ALNyDCkW9y8"
    },
    {
        "exerciseId": 16,
        "exerciseName": "Rear Delt Fly",
        "muscleGroup": "Sholders",
        "description": "Lean forward, letting your arms hang down next to your calves with your elbows slightly bent. Slowly raise the weights until your elbows are level with your shoulders. Then slowly lower the weights to the starting position. You'll feel tension in your shoulders and the muscles across your upper back",
        "repRange": "8-12",
        "difficulty": "Beginner",
        "imageUrl": "assets/images/reverseFly.jpg",
        "video": "https://www.youtube.com/embed/6yMdhi2DVao"
    },
    {
        "exerciseId": 17,
        "exerciseName": "Pull ups",
        "muscleGroup": "Back",
        "description": "A pullup is a challenging upper body exercise where you grip an overhead bar and lift your body until your chin is above that bar. It's a hard exercise to execute — so hard, in fact, that a U.S. Marine can receive a passing score on the annual physical fitness test without doing pullups at all.",
        "repRange": "8-12",
        "difficulty": "Intermediate",
        "imageUrl": "assets/images/pullUp.jpg",
        "video": "https://www.youtube.com/embed/jFmCrA6fo78"
    },
    {
        "exerciseId": 18,
        "exerciseName": "Bicep Curl",
        "muscleGroup": "Arms",
        "description": "Hold the barbell with both hands facing up so the wrists, elbows, and shoulders are in a straight line about shoulder-width apart. Lift the barbell toward the shoulders while bending the elbows and keeping them next to the middle of the body. Slowly lower the weight to return to the starting position.",
        "repRange": "8-12",
        "difficulty": "Beginner",
        "imageUrl": "assets/images/bicepCurls.jpg",
        "video": "https://www.youtube.com/embed/av7-8igSXTs"
    },
    {
        "exerciseId": 19,
        "exerciseName": "Skull Crushers",
        "muscleGroup": "Arms",
        "description": "The more mundane name for skull crushers is “lying triceps extensions.” This exercise is typically performed lying on your back (supine) with a barbell or dumbbells. Skull crushers work your triceps — the muscle on the back of your upper arm. The triceps, as the name implies, is a muscle with three heads.",
        "repRange": "8-12",
        "difficulty": "Beginner",
        "imageUrl": "assets/images/skullCrushers.jpg",
        "video": "https://www.youtube.com/embed/VP9Qp72zZ_c"
    },
    {
        "exerciseId": 20,
        "exerciseName": "Hammer Curls",
        "muscleGroup": "Arms",
        "description": "The hammer curl, also known as the dumbbell hammer curl or the neutral grip dumbbell curl, is a strength training exercise that targets your biceps and forearms. The hammer curl varies from the traditional bicep curl by using a neutral grip with your palms facing each other during the full range of motion",
        "repRange": "8-12",
        "difficulty": "Beginner",
        "imageUrl": "assets/images/hammerCurls.webp",
        "video": "https://www.youtube.com/embed/7jqi2qWAUJk"
    },
    {
        "exerciseId": 21,
        "exerciseName": "Bench Press",
        "muscleGroup": "Compound",
        "description": "The bench press is a compound exercise that targets the muscles of the upper body. It involves lying on a bench and pressing weight upward using either a barbell or a pair of dumbbells. During a bench press, you lower the weight down to chest level and then press upwards while extending your arms",
        "repRange": "8-12",
        "difficulty": "Intermediate",
        "imageUrl": "assets/images/bench.jpg",
        "video": "https://www.youtube.com/embed/-MAABwVKxok"
    },
    {
        "exerciseId": 22,
        "exerciseName": "Incline Bench Press",
        "muscleGroup": "Chest",
        "description": "The Incline Bench Press is a version of the traditional Bench Press in which the bench is positioned at about a 45-degree angle. The resulting inclined position targets your upper chest and the frontside of your shoulders more the the standard flat bench.",
        "repRange": "8-12",
        "difficulty": "Beginner",
        "imageUrl": "assets/images/inclineBench.jpg",
        "video": "https://www.youtube.com/embed/0G2_XV7slIg"
    },
    {
        "exerciseId": 23,
        "exerciseName": "Landmine Press",
        "muscleGroup": "Chest",
        "description": "Start in a single-arm landmine press position, in a split stance with the opposite leg forwards. At the start of the movement your weight should be over your rear leg. Press up, turn your body and lift your back heel so your weight shifts forwards onto your front foot. Then rotate back down as you lower the weight.",
        "repRange": "8-12",
        "difficulty": "Beginner",
        "imageUrl": "assets/images/landmine.jpg",
        "video": "https://www.youtube.com/embed/kThJ3CopV9Q"
    },
    {
        "exerciseId": 24,
        "exerciseName": "Push Ups",
        "muscleGroup": "Arms",
        "description": "Pushups are an exercise in which a person, keeping a prone position, with the hands palms down under the shoulders, the balls of the feet on the ground, and the back straight, pushes the body up and lets it down by an alternate straightening and bending of the arms",
        "repRange": "8-12",
        "difficulty": "Beginner",
        "imageUrl": "assets/images/pushUp.jpg",
        "video": "https://www.youtube.com/embed/i9sTjhN4Z3M"
    },
    {
        "exerciseId": 25,
        "exerciseName": "Cable Fly",
        "muscleGroup": "Arms",
        "description": "Hold the barbell with both hands facing up so the wrists, elbows, and shoulders are in a straight line about shoulder-width apart. Lift the barbell toward the shoulders while bending the elbows and keeping them next to the middle of the body. Slowly lower the weight to return to the starting position.",
        "repRange": "8-12",
        "difficulty": "Beginner",
        "imageUrl": "assets/images/cableFly.jpg",
        "video": "https://www.youtube.com/embed/HXVtFoExms0"
    }
  ]